package CH4.Level2;

/**
 * ==========================================================
 * [제목] 문자열 게임 2
 * ==========================================================
 * [문제]
 * 알파벳 소문자로 이루어진 문자열 W가 주어진다.
 * 양의 정수 K가 주어진다.
 * 어떤 문자를 정확히 K개를 포함하는 가장 짧은 연속 문자열의 길이를 구한다.
 * <p>
 * ==========================================================
 * [제한 사항]
 * ==========================================================
 * [풀이]
 * 1. 주어진 문자열에서 중복되지 않게 하나씩 뽑아! 그리고 그 한개씩 FOR문을 돌려
 * 2. 시작 포지션, 마지막 포지션 각각 두고
 * 3. 주어진 K정수가 나올 떄까지 마지막 포지션을 +1씩 늘려
 * 4. 그리고 K정수가 나오는 순간 시작부터 마지막지점까지의 String값을 저장
 * 5.
 */
public class backjoon20437 {

    public static void main(String[] args) {
        new T

    public int ThirdQ() {


        return 1;
    }
}
